Autodesk.Revit.DB.RenderingSettings.GetRenderingRegionOutline
Returns the outline of the rendering region.
Returns:
The outline of the rendering region.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RenderingSettings are not currently using region rendering.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.SetRenderingQualitySettings(Autodesk.Revit.DB.RenderingQualitySettings)
Change rendering quality settings.
settings:
An instance of the new rendering quality settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RenderingSettings.GetRenderingQualitySettings
Returns an object that represents the rendering quality settings.
Returns:
The rendering quality settings.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.SetRenderingImageExposureSettings(Autodesk.Revit.DB.RenderingImageExposureSettings)
Changes the rendering image exposure settings.
exposure:
An instance of the new rendering image exposure settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RenderingSettings.GetRenderingImageExposureSettings
Returns an  object that represents the rendering image exposure settings.
Returns:
The rendering image exposure settings.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.SetBackgroundSettings(Autodesk.Revit.DB.BackgroundSettings)
Changes the rendering background settings details for the current background style.
background:
An instance of the new rendering background settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RenderingSettings.GetBackgroundSettings
Returns an object that represents the rendering background settings.
Remarks:
Different kind of settings object will be returned according to different background style.
It could be SkyBackgroundSettings, ColorBackgroundSettings, or ImageBackgroundSettings.
Returns:
The rendering background settings.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RenderingSettings.ResolutionValue
The rendering resolution in dots per inch (DPI).
Since:
2013

Autodesk.Revit.DB.RenderingSettings.LightingSource
The lighting scheme type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RenderingSettings.PrinterResolution
The resolution level when using printer.
Remarks:
The suitable resolution value is decided by default. You may obtain it from the ResolutionValue property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resolution target is not printer.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.ResolutionTarget
The resolution target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RenderingSettings.BackgroundStyle
The enum value that controls the background style for rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RenderingSettings.UsesRegionRendering
The bool value that indicates whether to use region rendering.
Since:
2013

Autodesk.Revit.DB.RenderingSettings
Represents the rendering settings for a 3d view.
Since:
2013